MikroElektronika/core_packages/PIC/XC8/def/PIC16F1575/mcu.h
// Register: PWM1PHL
#define PWM1PHL PWM1PHL
extern volatile unsigned char           PWM1PHL             __at(0xD91);
#ifndef _LIB_BUILD
asm("PWM1PHL equ 0D91h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM1PHL0               :1;
        unsigned PWM1PHL1               :1;
        unsigned PWM1PHL2               :1;
        unsigned PWM1PHL3               :1;
        unsigned PWM1PHL4               :1;
        unsigned PWM1PHL5               :1;
        unsigned PWM1PHL6               :1;
        unsigned PWM1PHL7               :1;
    };
    struct {
        unsigned PWM1PHL                :8;
    };
} PWM1PHLbits_t;
extern volatile PWM1PHLbits_t PWM1PHLbits __at(0xD91);
// bitfield macros
#define _PWM1PHL_PH_POSN                                    0x0
#define _PWM1PHL_PH_POSITION                                0x0
#define _PWM1PHL_PH_SIZE                                    0x8
#define _PWM1PHL_PH_LENGTH                                  0x8
#define _PWM1PHL_PH_MASK                                    0xFF
#define _PWM1PHL_PWM1PHL0_POSN                              0x0
#define _PWM1PHL_PWM1PHL0_POSITION                          0x0
#define _PWM1PHL_PWM1PHL0_SIZE                              0x1
#define _PWM1PHL_PWM1PHL0_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL0_MASK                              0x1
#define _PWM1PHL_PWM1PHL1_POSN                              0x1
#define _PWM1PHL_PWM1PHL1_POSITION                          0x1
#define _PWM1PHL_PWM1PHL1_SIZE                              0x1
#define _PWM1PHL_PWM1PHL1_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL1_MASK                              0x2
#define _PWM1PHL_PWM1PHL2_POSN                              0x2
#define _PWM1PHL_PWM1PHL2_POSITION                          0x2
#define _PWM1PHL_PWM1PHL2_SIZE                              0x1
#define _PWM1PHL_PWM1PHL2_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL2_MASK                              0x4
#define _PWM1PHL_PWM1PHL3_POSN                              0x3
#define _PWM1PHL_PWM1PHL3_POSITION                          0x3
#define _PWM1PHL_PWM1PHL3_SIZE                              0x1
#define _PWM1PHL_PWM1PHL3_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL3_MASK                              0x8
#define _PWM1PHL_PWM1PHL4_POSN                              0x4
#define _PWM1PHL_PWM1PHL4_POSITION                          0x4
#define _PWM1PHL_PWM1PHL4_SIZE                              0x1
#define _PWM1PHL_PWM1PHL4_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL4_MASK                              0x10
#define _PWM1PHL_PWM1PHL5_POSN                              0x5
#define _PWM1PHL_PWM1PHL5_POSITION                          0x5
#define _PWM1PHL_PWM1PHL5_SIZE                              0x1
#define _PWM1PHL_PWM1PHL5_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL5_MASK                              0x20
#define _PWM1PHL_PWM1PHL6_POSN                              0x6
#define _PWM1PHL_PWM1PHL6_POSITION                          0x6
#define _PWM1PHL_PWM1PHL6_SIZE                              0x1
#define _PWM1PHL_PWM1PHL6_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL6_MASK                              0x40
#define _PWM1PHL_PWM1PHL7_POSN                              0x7
#define _PWM1PHL_PWM1PHL7_POSITION                          0x7
#define _PWM1PHL_PWM1PHL7_SIZE                              0x1
#define _PWM1PHL_PWM1PHL7_LENGTH                            0x1
#define _PWM1PHL_PWM1PHL7_MASK                              0x80
#define _PWM1PHL_PWM1PHL_POSN                               0x0
#define _PWM1PHL_PWM1PHL_POSITION                           0x0
#define _PWM1PHL_PWM1PHL_SIZE                               0x8
#define _PWM1PHL_PWM1PHL_LENGTH                             0x8
#define _PWM1PHL_PWM1PHL_MASK                               0xFF

// Register: PWM1PHH
#define PWM1PHH PWM1PHH
extern volatile unsigned char           PWM1PHH             __at(0xD92);
#ifndef _LIB_BUILD
asm("PWM1PHH equ 0D92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM1PHH0               :1;
        unsigned PWM1PHH1               :1;
        unsigned PWM1PHH2               :1;
        unsigned PWM1PHH3               :1;
        unsigned PWM1PHH4               :1;
        unsigned PWM1PHH5               :1;
        unsigned PWM1PHH6               :1;
        unsigned PWM1PHH7               :1;
    };
    struct {
        unsigned PWM1PHH                :8;
    };
} PWM1PHHbits_t;
extern volatile PWM1PHHbits_t PWM1PHHbits __at(0xD92);
// bitfield macros
#define _PWM1PHH_PH_POSN                                    0x0
#define _PWM1PHH_PH_POSITION                                0x0
#define _PWM1PHH_PH_SIZE                                    0x8
#define _PWM1PHH_PH_LENGTH                                  0x8
#define _PWM1PHH_PH_MASK                                    0xFF
#define _PWM1PHH_PWM1PHH0_POSN                              0x0
#define _PWM1PHH_PWM1PHH0_POSITION                          0x0
#define _PWM1PHH_PWM1PHH0_SIZE                              0x1
#define _PWM1PHH_PWM1PHH0_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH0_MASK                              0x1
#define _PWM1PHH_PWM1PHH1_POSN                              0x1
#define _PWM1PHH_PWM1PHH1_POSITION                          0x1
#define _PWM1PHH_PWM1PHH1_SIZE                              0x1
#define _PWM1PHH_PWM1PHH1_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH1_MASK                              0x2
#define _PWM1PHH_PWM1PHH2_POSN                              0x2
#define _PWM1PHH_PWM1PHH2_POSITION                          0x2
#define _PWM1PHH_PWM1PHH2_SIZE                              0x1
#define _PWM1PHH_PWM1PHH2_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH2_MASK                              0x4
#define _PWM1PHH_PWM1PHH3_POSN                              0x3
#define _PWM1PHH_PWM1PHH3_POSITION                          0x3
#define _PWM1PHH_PWM1PHH3_SIZE                              0x1
#define _PWM1PHH_PWM1PHH3_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH3_MASK                              0x8
#define _PWM1PHH_PWM1PHH4_POSN                              0x4
#define _PWM1PHH_PWM1PHH4_POSITION                          0x4
#define _PWM1PHH_PWM1PHH4_SIZE                              0x1
#define _PWM1PHH_PWM1PHH4_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH4_MASK                              0x10
#define _PWM1PHH_PWM1PHH5_POSN                              0x5
#define _PWM1PHH_PWM1PHH5_POSITION                          0x5
#define _PWM1PHH_PWM1PHH5_SIZE                              0x1
#define _PWM1PHH_PWM1PHH5_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH5_MASK                              0x20
#define _PWM1PHH_PWM1PHH6_POSN                              0x6
#define _PWM1PHH_PWM1PHH6_POSITION                          0x6
#define _PWM1PHH_PWM1PHH6_SIZE                              0x1
#define _PWM1PHH_PWM1PHH6_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH6_MASK                              0x40
#define _PWM1PHH_PWM1PHH7_POSN                              0x7
#define _PWM1PHH_PWM1PHH7_POSITION                          0x7
#define _PWM1PHH_PWM1PHH7_SIZE                              0x1
#define _PWM1PHH_PWM1PHH7_LENGTH                            0x1
#define _PWM1PHH_PWM1PHH7_MASK                              0x80
#define _PWM1PHH_PWM1PHH_POSN                               0x0
#define _PWM1PHH_PWM1PHH_POSITION                           0x0
#define _PWM1PHH_PWM1PHH_SIZE                               0x8
#define _PWM1PHH_PWM1PHH_LENGTH                             0x8
#define _PWM1PHH_PWM1PHH_MASK                               0xFF

