MikroElektronika/core_packages/PIC/XC8/def/PIC16F1575/mcu.h
// Register: PWM2DCH
#define PWM2DCH PWM2DCH
extern volatile unsigned char           PWM2DCH             __at(0xDA4);
#ifndef _LIB_BUILD
asm("PWM2DCH equ 0DA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM2DCH0               :1;
        unsigned PWM2DCH1               :1;
        unsigned PWM2DCH2               :1;
        unsigned PWM2DCH3               :1;
        unsigned PWM2DCH4               :1;
        unsigned PWM2DCH5               :1;
        unsigned PWM2DCH6               :1;
        unsigned PWM2DCH7               :1;
    };
    struct {
        unsigned PWM2DCH                :8;
    };
} PWM2DCHbits_t;
extern volatile PWM2DCHbits_t PWM2DCHbits __at(0xDA4);
// bitfield macros
#define _PWM2DCH_DC_POSN                                    0x0
#define _PWM2DCH_DC_POSITION                                0x0
#define _PWM2DCH_DC_SIZE                                    0x8
#define _PWM2DCH_DC_LENGTH                                  0x8
#define _PWM2DCH_DC_MASK                                    0xFF
#define _PWM2DCH_PWM2DCH0_POSN                              0x0
#define _PWM2DCH_PWM2DCH0_POSITION                          0x0
#define _PWM2DCH_PWM2DCH0_SIZE                              0x1
#define _PWM2DCH_PWM2DCH0_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH0_MASK                              0x1
#define _PWM2DCH_PWM2DCH1_POSN                              0x1
#define _PWM2DCH_PWM2DCH1_POSITION                          0x1
#define _PWM2DCH_PWM2DCH1_SIZE                              0x1
#define _PWM2DCH_PWM2DCH1_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH1_MASK                              0x2
#define _PWM2DCH_PWM2DCH2_POSN                              0x2
#define _PWM2DCH_PWM2DCH2_POSITION                          0x2
#define _PWM2DCH_PWM2DCH2_SIZE                              0x1
#define _PWM2DCH_PWM2DCH2_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH2_MASK                              0x4
#define _PWM2DCH_PWM2DCH3_POSN                              0x3
#define _PWM2DCH_PWM2DCH3_POSITION                          0x3
#define _PWM2DCH_PWM2DCH3_SIZE                              0x1
#define _PWM2DCH_PWM2DCH3_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH3_MASK                              0x8
#define _PWM2DCH_PWM2DCH4_POSN                              0x4
#define _PWM2DCH_PWM2DCH4_POSITION                          0x4
#define _PWM2DCH_PWM2DCH4_SIZE                              0x1
#define _PWM2DCH_PWM2DCH4_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH4_MASK                              0x10
#define _PWM2DCH_PWM2DCH5_POSN                              0x5
#define _PWM2DCH_PWM2DCH5_POSITION                          0x5
#define _PWM2DCH_PWM2DCH5_SIZE                              0x1
#define _PWM2DCH_PWM2DCH5_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH5_MASK                              0x20
#define _PWM2DCH_PWM2DCH6_POSN                              0x6
#define _PWM2DCH_PWM2DCH6_POSITION                          0x6
#define _PWM2DCH_PWM2DCH6_SIZE                              0x1
#define _PWM2DCH_PWM2DCH6_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH6_MASK                              0x40
#define _PWM2DCH_PWM2DCH7_POSN                              0x7
#define _PWM2DCH_PWM2DCH7_POSITION                          0x7
#define _PWM2DCH_PWM2DCH7_SIZE                              0x1
#define _PWM2DCH_PWM2DCH7_LENGTH                            0x1
#define _PWM2DCH_PWM2DCH7_MASK                              0x80
#define _PWM2DCH_PWM2DCH_POSN                               0x0
#define _PWM2DCH_PWM2DCH_POSITION                           0x0
#define _PWM2DCH_PWM2DCH_SIZE                               0x8
#define _PWM2DCH_PWM2DCH_LENGTH                             0x8
#define _PWM2DCH_PWM2DCH_MASK                               0xFF

// Register: PWM2PR
#define PWM2PR PWM2PR
extern volatile unsigned short          PWM2PR              __at(0xDA5);
#ifndef _LIB_BUILD
asm("PWM2PR equ 0DA5h");
#endif

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
extern volatile unsigned char           PWM2PRL             __at(0xDA5);
#ifndef _LIB_BUILD
asm("PWM2PRL equ 0DA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM2PRL0               :1;
        unsigned PWM2PRL1               :1;
        unsigned PWM2PRL2               :1;
        unsigned PWM2PRL3               :1;
        unsigned PWM2PRL4               :1;
        unsigned PWM2PRL5               :1;
        unsigned PWM2PRL6               :1;
        unsigned PWM2PRL7               :1;
    };
    struct {
        unsigned PWM2PRL                :8;
    };
} PWM2PRLbits_t;
extern volatile PWM2PRLbits_t PWM2PRLbits __at(0xDA5);
// bitfield macros
#define _PWM2PRL_PR_POSN                                    0x0
#define _PWM2PRL_PR_POSITION                                0x0
#define _PWM2PRL_PR_SIZE                                    0x8
#define _PWM2PRL_PR_LENGTH                                  0x8
#define _PWM2PRL_PR_MASK                                    0xFF
#define _PWM2PRL_PWM2PRL0_POSN                              0x0
#define _PWM2PRL_PWM2PRL0_POSITION                          0x0
#define _PWM2PRL_PWM2PRL0_SIZE                              0x1
#define _PWM2PRL_PWM2PRL0_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL0_MASK                              0x1
#define _PWM2PRL_PWM2PRL1_POSN                              0x1
#define _PWM2PRL_PWM2PRL1_POSITION                          0x1
#define _PWM2PRL_PWM2PRL1_SIZE                              0x1
#define _PWM2PRL_PWM2PRL1_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL1_MASK                              0x2
#define _PWM2PRL_PWM2PRL2_POSN                              0x2
#define _PWM2PRL_PWM2PRL2_POSITION                          0x2
#define _PWM2PRL_PWM2PRL2_SIZE                              0x1
#define _PWM2PRL_PWM2PRL2_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL2_MASK                              0x4
#define _PWM2PRL_PWM2PRL3_POSN                              0x3
#define _PWM2PRL_PWM2PRL3_POSITION                          0x3
#define _PWM2PRL_PWM2PRL3_SIZE                              0x1
#define _PWM2PRL_PWM2PRL3_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL3_MASK                              0x8
#define _PWM2PRL_PWM2PRL4_POSN                              0x4
#define _PWM2PRL_PWM2PRL4_POSITION                          0x4
#define _PWM2PRL_PWM2PRL4_SIZE                              0x1
#define _PWM2PRL_PWM2PRL4_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL4_MASK                              0x10
#define _PWM2PRL_PWM2PRL5_POSN                              0x5
#define _PWM2PRL_PWM2PRL5_POSITION                          0x5
#define _PWM2PRL_PWM2PRL5_SIZE                              0x1
#define _PWM2PRL_PWM2PRL5_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL5_MASK                              0x20
#define _PWM2PRL_PWM2PRL6_POSN                              0x6
#define _PWM2PRL_PWM2PRL6_POSITION                          0x6
#define _PWM2PRL_PWM2PRL6_SIZE                              0x1
#define _PWM2PRL_PWM2PRL6_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL6_MASK                              0x40
#define _PWM2PRL_PWM2PRL7_POSN                              0x7
#define _PWM2PRL_PWM2PRL7_POSITION                          0x7
#define _PWM2PRL_PWM2PRL7_SIZE                              0x1
#define _PWM2PRL_PWM2PRL7_LENGTH                            0x1
#define _PWM2PRL_PWM2PRL7_MASK                              0x80
#define _PWM2PRL_PWM2PRL_POSN                               0x0
#define _PWM2PRL_PWM2PRL_POSITION                           0x0
#define _PWM2PRL_PWM2PRL_SIZE                               0x8
#define _PWM2PRL_PWM2PRL_LENGTH                             0x8
#define _PWM2PRL_PWM2PRL_MASK                               0xFF

