MikroElektronika/core_packages/PIC/XC8/def/PIC16F1575/mcu.h
extern volatile __bit                   PWM4DCL7            __at(0x6E1F);	// @ (0xDC3 * 8 + 7)
#define                                 PWM4DCL7_bit        _BIT_ACCESS(PWM4DCL,7)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x6E5F);	// @ (0xDCB * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWMEN<PWM4EN_A>
extern volatile __bit                   PWM4EN_A            __at(0x6C73);	// @ (0xD8E * 8 + 3)
#define                                 PWM4EN_A_bit        _BIT_ACCESS(PWMEN,3)
// PIE3<PWM4IE>
extern volatile __bit                   PWM4IE              __at(0x49F);	// @ (0x93 * 8 + 7)
#define                                 PWM4IE_bit          _BIT_ACCESS(PIE3,7)
// PIR3<PWM4IF>
extern volatile __bit                   PWM4IF              __at(0x9F);	// @ (0x13 * 8 + 7)
#define                                 PWM4IF_bit          _BIT_ACCESS(PIR3,7)
// PWM4LDCON<PWM4LD>
extern volatile __bit                   PWM4LD              __at(0x6E7F);	// @ (0xDCF * 8 + 7)
#define                                 PWM4LD_bit          _BIT_ACCESS(PWM4LDCON,7)
// PWMLD<PWM4LDA_A>
extern volatile __bit                   PWM4LDA_A           __at(0x6C7B);	// @ (0xD8F * 8 + 3)
#define                                 PWM4LDA_A_bit       _BIT_ACCESS(PWMLD,3)
// PWM4LDCON<PWM4LDM>
extern volatile __bit                   PWM4LDM             __at(0x6E7E);	// @ (0xDCF * 8 + 6)
#define                                 PWM4LDM_bit         _BIT_ACCESS(PWM4LDCON,6)
// PWM4LDCON<PWM4LDS0>
extern volatile __bit                   PWM4LDS0            __at(0x6E78);	// @ (0xDCF * 8 + 0)
#define                                 PWM4LDS0_bit        _BIT_ACCESS(PWM4LDCON,0)
// PWM4LDCON<PWM4LDS1>
extern volatile __bit                   PWM4LDS1            __at(0x6E79);	// @ (0xDCF * 8 + 1)
#define                                 PWM4LDS1_bit        _BIT_ACCESS(PWM4LDCON,1)
// PWM4CON<PWM4MODE0>
extern volatile __bit                   PWM4MODE0           __at(0x6E5A);	// @ (0xDCB * 8 + 2)
#define                                 PWM4MODE0_bit       _BIT_ACCESS(PWM4CON,2)
// PWM4CON<PWM4MODE1>
extern volatile __bit                   PWM4MODE1           __at(0x6E5B);	// @ (0xDCB * 8 + 3)
#define                                 PWM4MODE1_bit       _BIT_ACCESS(PWM4CON,3)
// PWM4CON<PWM4OE>
extern volatile __bit                   PWM4OE              __at(0x6E5E);	// @ (0xDCB * 8 + 6)
#define                                 PWM4OE_bit          _BIT_ACCESS(PWM4CON,6)
// PWM4OFH<PWM4OFH0>
extern volatile __bit                   PWM4OFH0            __at(0x6E40);	// @ (0xDC8 * 8 + 0)
#define                                 PWM4OFH0_bit        _BIT_ACCESS(PWM4OFH,0)
// PWM4OFH<PWM4OFH1>
extern volatile __bit                   PWM4OFH1            __at(0x6E41);	// @ (0xDC8 * 8 + 1)
#define                                 PWM4OFH1_bit        _BIT_ACCESS(PWM4OFH,1)
// PWM4OFH<PWM4OFH2>
extern volatile __bit                   PWM4OFH2            __at(0x6E42);	// @ (0xDC8 * 8 + 2)
#define                                 PWM4OFH2_bit        _BIT_ACCESS(PWM4OFH,2)
// PWM4OFH<PWM4OFH3>
extern volatile __bit                   PWM4OFH3            __at(0x6E43);	// @ (0xDC8 * 8 + 3)
#define                                 PWM4OFH3_bit        _BIT_ACCESS(PWM4OFH,3)
// PWM4OFH<PWM4OFH4>
extern volatile __bit                   PWM4OFH4            __at(0x6E44);	// @ (0xDC8 * 8 + 4)
#define                                 PWM4OFH4_bit        _BIT_ACCESS(PWM4OFH,4)
// PWM4OFH<PWM4OFH5>
extern volatile __bit                   PWM4OFH5            __at(0x6E45);	// @ (0xDC8 * 8 + 5)
#define                                 PWM4OFH5_bit        _BIT_ACCESS(PWM4OFH,5)
// PWM4OFH<PWM4OFH6>
extern volatile __bit                   PWM4OFH6            __at(0x6E46);	// @ (0xDC8 * 8 + 6)
#define                                 PWM4OFH6_bit        _BIT_ACCESS(PWM4OFH,6)
// PWM4OFH<PWM4OFH7>
extern volatile __bit                   PWM4OFH7            __at(0x6E47);	// @ (0xDC8 * 8 + 7)
#define                                 PWM4OFH7_bit        _BIT_ACCESS(PWM4OFH,7)
// PWM4INTE<PWM4OFIE>
extern volatile __bit                   PWM4OFIE            __at(0x6E63);	// @ (0xDCC * 8 + 3)
#define                                 PWM4OFIE_bit        _BIT_ACCESS(PWM4INTE,3)
// PWM4INTF<PWM4OFIF>
extern volatile __bit                   PWM4OFIF            __at(0x6E6B);	// @ (0xDCD * 8 + 3)
#define                                 PWM4OFIF_bit        _BIT_ACCESS(PWM4INTF,3)
// PWM4OFL<PWM4OFL0>
extern volatile __bit                   PWM4OFL0            __at(0x6E38);	// @ (0xDC7 * 8 + 0)
#define                                 PWM4OFL0_bit        _BIT_ACCESS(PWM4OFL,0)
// PWM4OFL<PWM4OFL1>
extern volatile __bit                   PWM4OFL1            __at(0x6E39);	// @ (0xDC7 * 8 + 1)
#define                                 PWM4OFL1_bit        _BIT_ACCESS(PWM4OFL,1)
// PWM4OFL<PWM4OFL2>
extern volatile __bit                   PWM4OFL2            __at(0x6E3A);	// @ (0xDC7 * 8 + 2)
#define                                 PWM4OFL2_bit        _BIT_ACCESS(PWM4OFL,2)
// PWM4OFL<PWM4OFL3>
extern volatile __bit                   PWM4OFL3            __at(0x6E3B);	// @ (0xDC7 * 8 + 3)
#define                                 PWM4OFL3_bit        _BIT_ACCESS(PWM4OFL,3)
// PWM4OFL<PWM4OFL4>
extern volatile __bit                   PWM4OFL4            __at(0x6E3C);	// @ (0xDC7 * 8 + 4)
#define                                 PWM4OFL4_bit        _BIT_ACCESS(PWM4OFL,4)
// PWM4OFL<PWM4OFL5>
extern volatile __bit                   PWM4OFL5            __at(0x6E3D);	// @ (0xDC7 * 8 + 5)
#define                                 PWM4OFL5_bit        _BIT_ACCESS(PWM4OFL,5)
// PWM4OFL<PWM4OFL6>
extern volatile __bit                   PWM4OFL6            __at(0x6E3E);	// @ (0xDC7 * 8 + 6)
#define                                 PWM4OFL6_bit        _BIT_ACCESS(PWM4OFL,6)
// PWM4OFL<PWM4OFL7>
extern volatile __bit                   PWM4OFL7            __at(0x6E3F);	// @ (0xDC7 * 8 + 7)
#define                                 PWM4OFL7_bit        _BIT_ACCESS(PWM4OFL,7)
// PWM4OFCON<PWM4OFM0>
extern volatile __bit                   PWM4OFM0            __at(0x6E85);	// @ (0xDD0 * 8 + 5)
#define                                 PWM4OFM0_bit        _BIT_ACCESS(PWM4OFCON,5)
// PWM4OFCON<PWM4OFM1>
extern volatile __bit                   PWM4OFM1            __at(0x6E86);	// @ (0xDD0 * 8 + 6)
#define                                 PWM4OFM1_bit        _BIT_ACCESS(PWM4OFCON,6)
// PWM4OFCON<PWM4OFMC>
extern volatile __bit                   PWM4OFMC            __at(0x6E84);	// @ (0xDD0 * 8 + 4)
#define                                 PWM4OFMC_bit        _BIT_ACCESS(PWM4OFCON,4)
// PWM4OFCON<PWM4OFS0>
extern volatile __bit                   PWM4OFS0            __at(0x6E80);	// @ (0xDD0 * 8 + 0)
#define                                 PWM4OFS0_bit        _BIT_ACCESS(PWM4OFCON,0)
// PWM4OFCON<PWM4OFS1>
extern volatile __bit                   PWM4OFS1            __at(0x6E81);	// @ (0xDD0 * 8 + 1)
#define                                 PWM4OFS1_bit        _BIT_ACCESS(PWM4OFCON,1)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x6E5D);	// @ (0xDCB * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWMOUT<PWM4OUT_A>
extern volatile __bit                   PWM4OUT_A           __at(0x6C83);	// @ (0xD90 * 8 + 3)
#define                                 PWM4OUT_A_bit       _BIT_ACCESS(PWMOUT,3)
// PWM4PHH<PWM4PHH0>
extern volatile __bit                   PWM4PHH0            __at(0x6E10);	// @ (0xDC2 * 8 + 0)
#define                                 PWM4PHH0_bit        _BIT_ACCESS(PWM4PHH,0)
// PWM4PHH<PWM4PHH1>
extern volatile __bit                   PWM4PHH1            __at(0x6E11);	// @ (0xDC2 * 8 + 1)
#define                                 PWM4PHH1_bit        _BIT_ACCESS(PWM4PHH,1)
// PWM4PHH<PWM4PHH2>
extern volatile __bit                   PWM4PHH2            __at(0x6E12);	// @ (0xDC2 * 8 + 2)
#define                                 PWM4PHH2_bit        _BIT_ACCESS(PWM4PHH,2)
// PWM4PHH<PWM4PHH3>
extern volatile __bit                   PWM4PHH3            __at(0x6E13);	// @ (0xDC2 * 8 + 3)
#define                                 PWM4PHH3_bit        _BIT_ACCESS(PWM4PHH,3)
// PWM4PHH<PWM4PHH4>
extern volatile __bit                   PWM4PHH4            __at(0x6E14);	// @ (0xDC2 * 8 + 4)
#define                                 PWM4PHH4_bit        _BIT_ACCESS(PWM4PHH,4)
// PWM4PHH<PWM4PHH5>
extern volatile __bit                   PWM4PHH5            __at(0x6E15);	// @ (0xDC2 * 8 + 5)
#define                                 PWM4PHH5_bit        _BIT_ACCESS(PWM4PHH,5)
// PWM4PHH<PWM4PHH6>
extern volatile __bit                   PWM4PHH6            __at(0x6E16);	// @ (0xDC2 * 8 + 6)
#define                                 PWM4PHH6_bit        _BIT_ACCESS(PWM4PHH,6)
// PWM4PHH<PWM4PHH7>
extern volatile __bit                   PWM4PHH7            __at(0x6E17);	// @ (0xDC2 * 8 + 7)
#define                                 PWM4PHH7_bit        _BIT_ACCESS(PWM4PHH,7)
// PWM4INTE<PWM4PHIE>
extern volatile __bit                   PWM4PHIE            __at(0x6E62);	// @ (0xDCC * 8 + 2)
#define                                 PWM4PHIE_bit        _BIT_ACCESS(PWM4INTE,2)
// PWM4INTF<PWM4PHIF>
extern volatile __bit                   PWM4PHIF            __at(0x6E6A);	// @ (0xDCD * 8 + 2)
#define                                 PWM4PHIF_bit        _BIT_ACCESS(PWM4INTF,2)
// PWM4PHL<PWM4PHL0>
extern volatile __bit                   PWM4PHL0            __at(0x6E08);	// @ (0xDC1 * 8 + 0)
#define                                 PWM4PHL0_bit        _BIT_ACCESS(PWM4PHL,0)
// PWM4PHL<PWM4PHL1>
extern volatile __bit                   PWM4PHL1            __at(0x6E09);	// @ (0xDC1 * 8 + 1)
#define                                 PWM4PHL1_bit        _BIT_ACCESS(PWM4PHL,1)
// PWM4PHL<PWM4PHL2>
extern volatile __bit                   PWM4PHL2            __at(0x6E0A);	// @ (0xDC1 * 8 + 2)
#define                                 PWM4PHL2_bit        _BIT_ACCESS(PWM4PHL,2)
// PWM4PHL<PWM4PHL3>
extern volatile __bit                   PWM4PHL3            __at(0x6E0B);	// @ (0xDC1 * 8 + 3)
#define                                 PWM4PHL3_bit        _BIT_ACCESS(PWM4PHL,3)
// PWM4PHL<PWM4PHL4>
extern volatile __bit                   PWM4PHL4            __at(0x6E0C);	// @ (0xDC1 * 8 + 4)
#define                                 PWM4PHL4_bit        _BIT_ACCESS(PWM4PHL,4)
// PWM4PHL<PWM4PHL5>
extern volatile __bit                   PWM4PHL5            __at(0x6E0D);	// @ (0xDC1 * 8 + 5)
#define                                 PWM4PHL5_bit        _BIT_ACCESS(PWM4PHL,5)
// PWM4PHL<PWM4PHL6>
extern volatile __bit                   PWM4PHL6            __at(0x6E0E);	// @ (0xDC1 * 8 + 6)
#define                                 PWM4PHL6_bit        _BIT_ACCESS(PWM4PHL,6)
// PWM4PHL<PWM4PHL7>
extern volatile __bit                   PWM4PHL7            __at(0x6E0F);	// @ (0xDC1 * 8 + 7)
#define                                 PWM4PHL7_bit        _BIT_ACCESS(PWM4PHL,7)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x6E5C);	// @ (0xDCB * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// PWM4PRH<PWM4PRH0>
extern volatile __bit                   PWM4PRH0            __at(0x6E30);	// @ (0xDC6 * 8 + 0)
#define                                 PWM4PRH0_bit        _BIT_ACCESS(PWM4PRH,0)
// PWM4PRH<PWM4PRH1>
extern volatile __bit                   PWM4PRH1            __at(0x6E31);	// @ (0xDC6 * 8 + 1)
#define                                 PWM4PRH1_bit        _BIT_ACCESS(PWM4PRH,1)
// PWM4PRH<PWM4PRH2>
extern volatile __bit                   PWM4PRH2            __at(0x6E32);	// @ (0xDC6 * 8 + 2)
#define                                 PWM4PRH2_bit        _BIT_ACCESS(PWM4PRH,2)
// PWM4PRH<PWM4PRH3>
extern volatile __bit                   PWM4PRH3            __at(0x6E33);	// @ (0xDC6 * 8 + 3)
#define                                 PWM4PRH3_bit        _BIT_ACCESS(PWM4PRH,3)
// PWM4PRH<PWM4PRH4>
extern volatile __bit                   PWM4PRH4            __at(0x6E34);	// @ (0xDC6 * 8 + 4)
#define                                 PWM4PRH4_bit        _BIT_ACCESS(PWM4PRH,4)
// PWM4PRH<PWM4PRH5>
extern volatile __bit                   PWM4PRH5            __at(0x6E35);	// @ (0xDC6 * 8 + 5)
#define                                 PWM4PRH5_bit        _BIT_ACCESS(PWM4PRH,5)
// PWM4PRH<PWM4PRH6>
extern volatile __bit                   PWM4PRH6            __at(0x6E36);	// @ (0xDC6 * 8 + 6)
#define                                 PWM4PRH6_bit        _BIT_ACCESS(PWM4PRH,6)
// PWM4PRH<PWM4PRH7>
extern volatile __bit                   PWM4PRH7            __at(0x6E37);	// @ (0xDC6 * 8 + 7)
#define                                 PWM4PRH7_bit        _BIT_ACCESS(PWM4PRH,7)
// PWM4INTE<PWM4PRIE>
extern volatile __bit                   PWM4PRIE            __at(0x6E60);	// @ (0xDCC * 8 + 0)
#define                                 PWM4PRIE_bit        _BIT_ACCESS(PWM4INTE,0)
// PWM4INTF<PWM4PRIF>
extern volatile __bit                   PWM4PRIF            __at(0x6E68);	// @ (0xDCD * 8 + 0)
#define                                 PWM4PRIF_bit        _BIT_ACCESS(PWM4INTF,0)
// PWM4PRL<PWM4PRL0>
extern volatile __bit                   PWM4PRL0            __at(0x6E28);	// @ (0xDC5 * 8 + 0)
#define                                 PWM4PRL0_bit        _BIT_ACCESS(PWM4PRL,0)
// PWM4PRL<PWM4PRL1>
extern volatile __bit                   PWM4PRL1            __at(0x6E29);	// @ (0xDC5 * 8 + 1)
#define                                 PWM4PRL1_bit        _BIT_ACCESS(PWM4PRL,1)
// PWM4PRL<PWM4PRL2>
extern volatile __bit                   PWM4PRL2            __at(0x6E2A);	// @ (0xDC5 * 8 + 2)
#define                                 PWM4PRL2_bit        _BIT_ACCESS(PWM4PRL,2)
// PWM4PRL<PWM4PRL3>
extern volatile __bit                   PWM4PRL3            __at(0x6E2B);	// @ (0xDC5 * 8 + 3)
#define                                 PWM4PRL3_bit        _BIT_ACCESS(PWM4PRL,3)
// PWM4PRL<PWM4PRL4>
extern volatile __bit                   PWM4PRL4            __at(0x6E2C);	// @ (0xDC5 * 8 + 4)
#define                                 PWM4PRL4_bit        _BIT_ACCESS(PWM4PRL,4)
// PWM4PRL<PWM4PRL5>
extern volatile __bit                   PWM4PRL5            __at(0x6E2D);	// @ (0xDC5 * 8 + 5)
#define                                 PWM4PRL5_bit        _BIT_ACCESS(PWM4PRL,5)
// PWM4PRL<PWM4PRL6>
extern volatile __bit                   PWM4PRL6            __at(0x6E2E);	// @ (0xDC5 * 8 + 6)
#define                                 PWM4PRL6_bit        _BIT_ACCESS(PWM4PRL,6)
// PWM4PRL<PWM4PRL7>
extern volatile __bit                   PWM4PRL7            __at(0x6E2F);	// @ (0xDC5 * 8 + 7)
#define                                 PWM4PRL7_bit        _BIT_ACCESS(PWM4PRL,7)
// PWM4CLKCON<PWM4PS0>
extern volatile __bit                   PWM4PS0             __at(0x6E74);	// @ (0xDCE * 8 + 4)
#define                                 PWM4PS0_bit         _BIT_ACCESS(PWM4CLKCON,4)
// PWM4CLKCON<PWM4PS1>
extern volatile __bit                   PWM4PS1             __at(0x6E75);	// @ (0xDCE * 8 + 5)
#define                                 PWM4PS1_bit         _BIT_ACCESS(PWM4CLKCON,5)
// PWM4CLKCON<PWM4PS2>
extern volatile __bit                   PWM4PS2             __at(0x6E76);	// @ (0xDCE * 8 + 6)
#define                                 PWM4PS2_bit         _BIT_ACCESS(PWM4CLKCON,6)
// PWM4TMRH<PWM4TMRH0>
extern volatile __bit                   PWM4TMRH0           __at(0x6E50);	// @ (0xDCA * 8 + 0)
#define                                 PWM4TMRH0_bit       _BIT_ACCESS(PWM4TMRH,0)
// PWM4TMRH<PWM4TMRH1>
extern volatile __bit                   PWM4TMRH1           __at(0x6E51);	// @ (0xDCA * 8 + 1)
#define                                 PWM4TMRH1_bit       _BIT_ACCESS(PWM4TMRH,1)
// PWM4TMRH<PWM4TMRH2>
extern volatile __bit                   PWM4TMRH2           __at(0x6E52);	// @ (0xDCA * 8 + 2)
#define                                 PWM4TMRH2_bit       _BIT_ACCESS(PWM4TMRH,2)
// PWM4TMRH<PWM4TMRH3>
extern volatile __bit                   PWM4TMRH3           __at(0x6E53);	// @ (0xDCA * 8 + 3)
#define                                 PWM4TMRH3_bit       _BIT_ACCESS(PWM4TMRH,3)
// PWM4TMRH<PWM4TMRH4>
extern volatile __bit                   PWM4TMRH4           __at(0x6E54);	// @ (0xDCA * 8 + 4)
#define                                 PWM4TMRH4_bit       _BIT_ACCESS(PWM4TMRH,4)
// PWM4TMRH<PWM4TMRH5>
extern volatile __bit                   PWM4TMRH5           __at(0x6E55);	// @ (0xDCA * 8 + 5)
#define                                 PWM4TMRH5_bit       _BIT_ACCESS(PWM4TMRH,5)
// PWM4TMRH<PWM4TMRH6>
extern volatile __bit                   PWM4TMRH6           __at(0x6E56);	// @ (0xDCA * 8 + 6)
#define                                 PWM4TMRH6_bit       _BIT_ACCESS(PWM4TMRH,6)
// PWM4TMRH<PWM4TMRH7>
extern volatile __bit                   PWM4TMRH7           __at(0x6E57);	// @ (0xDCA * 8 + 7)
#define                                 PWM4TMRH7_bit       _BIT_ACCESS(PWM4TMRH,7)
// PWM4TMRL<PWM4TMRL0>
extern volatile __bit                   PWM4TMRL0           __at(0x6E48);	// @ (0xDC9 * 8 + 0)
#define                                 PWM4TMRL0_bit       _BIT_ACCESS(PWM4TMRL,0)
// PWM4TMRL<PWM4TMRL1>
extern volatile __bit                   PWM4TMRL1           __at(0x6E49);	// @ (0xDC9 * 8 + 1)
#define                                 PWM4TMRL1_bit       _BIT_ACCESS(PWM4TMRL,1)
// PWM4TMRL<PWM4TMRL2>
extern volatile __bit                   PWM4TMRL2           __at(0x6E4A);	// @ (0xDC9 * 8 + 2)
#define                                 PWM4TMRL2_bit       _BIT_ACCESS(PWM4TMRL,2)
// PWM4TMRL<PWM4TMRL3>
extern volatile __bit                   PWM4TMRL3           __at(0x6E4B);	// @ (0xDC9 * 8 + 3)
#define                                 PWM4TMRL3_bit       _BIT_ACCESS(PWM4TMRL,3)
// PWM4TMRL<PWM4TMRL4>
extern volatile __bit                   PWM4TMRL4           __at(0x6E4C);	// @ (0xDC9 * 8 + 4)
#define                                 PWM4TMRL4_bit       _BIT_ACCESS(PWM4TMRL,4)
// PWM4TMRL<PWM4TMRL5>
extern volatile __bit                   PWM4TMRL5           __at(0x6E4D);	// @ (0xDC9 * 8 + 5)
#define                                 PWM4TMRL5_bit       _BIT_ACCESS(PWM4TMRL,5)
// PWM4TMRL<PWM4TMRL6>
extern volatile __bit                   PWM4TMRL6           __at(0x6E4E);	// @ (0xDC9 * 8 + 6)
#define                                 PWM4TMRL6_bit       _BIT_ACCESS(PWM4TMRL,6)
// PWM4TMRL<PWM4TMRL7>
extern volatile __bit                   PWM4TMRL7           __at(0x6E4F);	// @ (0xDC9 * 8 + 7)
#define                                 PWM4TMRL7_bit       _BIT_ACCESS(PWM4TMRL,7)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// RA0PPS<RA0PPS0>
extern volatile __bit                   RA0PPS0             __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 RA0PPS0_bit         _BIT_ACCESS(RA0PPS,0)
// RA0PPS<RA0PPS1>
extern volatile __bit                   RA0PPS1             __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 RA0PPS1_bit         _BIT_ACCESS(RA0PPS,1)
// RA0PPS<RA0PPS2>
extern volatile __bit                   RA0PPS2             __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 RA0PPS2_bit         _BIT_ACCESS(RA0PPS,2)
// RA0PPS<RA0PPS3>
extern volatile __bit                   RA0PPS3             __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 RA0PPS3_bit         _BIT_ACCESS(RA0PPS,3)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// RA1PPS<RA1PPS0>
extern volatile __bit                   RA1PPS0             __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 RA1PPS0_bit         _BIT_ACCESS(RA1PPS,0)
// RA1PPS<RA1PPS1>
extern volatile __bit                   RA1PPS1             __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 RA1PPS1_bit         _BIT_ACCESS(RA1PPS,1)
// RA1PPS<RA1PPS2>
extern volatile __bit                   RA1PPS2             __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 RA1PPS2_bit         _BIT_ACCESS(RA1PPS,2)
// RA1PPS<RA1PPS3>
extern volatile __bit                   RA1PPS3             __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 RA1PPS3_bit         _BIT_ACCESS(RA1PPS,3)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x62);	// @ (0xC * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// RA2PPS<RA2PPS0>
extern volatile __bit                   RA2PPS0             __at(0x7490);	// @ (0xE92 * 8 + 0)
#define                                 RA2PPS0_bit         _BIT_ACCESS(RA2PPS,0)
// RA2PPS<RA2PPS1>
extern volatile __bit                   RA2PPS1             __at(0x7491);	// @ (0xE92 * 8 + 1)
#define                                 RA2PPS1_bit         _BIT_ACCESS(RA2PPS,1)
// RA2PPS<RA2PPS2>
extern volatile __bit                   RA2PPS2             __at(0x7492);	// @ (0xE92 * 8 + 2)
#define                                 RA2PPS2_bit         _BIT_ACCESS(RA2PPS,2)
// RA2PPS<RA2PPS3>
extern volatile __bit                   RA2PPS3             __at(0x7493);	// @ (0xE92 * 8 + 3)
#define                                 RA2PPS3_bit         _BIT_ACCESS(RA2PPS,3)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x63);	// @ (0xC * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x64);	// @ (0xC * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// RA4PPS<RA4PPS0>
extern volatile __bit                   RA4PPS0             __at(0x74A0);	// @ (0xE94 * 8 + 0)
#define                                 RA4PPS0_bit         _BIT_ACCESS(RA4PPS,0)
// RA4PPS<RA4PPS1>
extern volatile __bit                   RA4PPS1             __at(0x74A1);	// @ (0xE94 * 8 + 1)
#define                                 RA4PPS1_bit         _BIT_ACCESS(RA4PPS,1)
// RA4PPS<RA4PPS2>
extern volatile __bit                   RA4PPS2             __at(0x74A2);	// @ (0xE94 * 8 + 2)
#define                                 RA4PPS2_bit         _BIT_ACCESS(RA4PPS,2)
// RA4PPS<RA4PPS3>
extern volatile __bit                   RA4PPS3             __at(0x74A3);	// @ (0xE94 * 8 + 3)
#define                                 RA4PPS3_bit         _BIT_ACCESS(RA4PPS,3)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// RA5PPS<RA5PPS0>
extern volatile __bit                   RA5PPS0             __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 RA5PPS0_bit         _BIT_ACCESS(RA5PPS,0)
// RA5PPS<RA5PPS1>
extern volatile __bit                   RA5PPS1             __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 RA5PPS1_bit         _BIT_ACCESS(RA5PPS,1)
// RA5PPS<RA5PPS2>
extern volatile __bit                   RA5PPS2             __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 RA5PPS2_bit         _BIT_ACCESS(RA5PPS,2)
// RA5PPS<RA5PPS3>
extern volatile __bit                   RA5PPS3             __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 RA5PPS3_bit         _BIT_ACCESS(RA5PPS,3)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x70);	// @ (0xE * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
